print('++++++++++++++++++++++++++++++++++++++++++++++++')
print('Условный оператор')
print('++++++++++++++++++++++++++++++++++++++++++++++++')
####################TASK_1##############################
x = int(input())
if  x > 0:
    print("Число положительное")
elif x < 0:
    print("Число отрицательное")
else:
    print( "Число равно нулю")
####################TASK_2##############################
x = int(input())
if  x % 2 == 0:
    print("Число четное")
else:
    print("Число нечетное")
####################TASK_3##############################
x = int(input())
if x >= 1 and x <= 10:
    print("Число в диапазоне")
else:
    print("Число вне диапазона")
####################TASK_4##############################
a = int(input())
b = int(input())
if a < b:
    a, b = b, a
print(a, b)
####################TASK_5##############################
a = int(input())
b = int(input())
print(min(a, b))
####################TASK_6##############################
marks = [3, 4, 5, 2, 5, 4]
if  2 in marks:
    print("Есть неудовлетворительная оценка")
else:
    print("Все оценки положительные")
####################TASK_7##############################
x = int(input())
if x % 3 == 0 and x % 5 == 0:
    print("Число делится на 3 и 5")
elif x % 3 == 0:
    print("Число делится только на 3")
elif x % 5 == 0:
    print("Число делится только на 5")
elif x % 3 != 0 and x % 5 != 0:
    print("Число не делится на 3 и 5")
####################TASK_8##############################
passwd = input()
if passwd == "admin123":
    print("Доступ разрешен")
else:
    print("Доступ запрещен")
####################TASK_9##############################
amount = int(input())
if amount >= 5000:
    res_big = amount - ((amount * 10) / 100)
    print(res_big)
elif amount >= 1000:
    res_small = amount - ((amount * 5) / 100)
    print(res_small)
else:
    print(amount)
####################TASK_10##############################
year = int(input())
if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
    print("Год високосный")
else:
    print("Год не високосный")
print('++++++++++++++++++++++++++++++++++++++++++++++++')
print('Вложенные условия и elif')
print('++++++++++++++++++++++++++++++++++++++++++++++++')
####################TASK_1##############################
mark = int(input())
if mark == 5:
    print("Отлично!")
elif mark == 4:
    print("Хорошо")
elif mark == 3:
    print("Удовлетворительно")
elif mark == 2 or mark == 1:
    print("Неудовлетворительно")
else:
    print("Некорректная оценка")
####################TASK_2##############################
hour = int(input())
if 6 <= hour <= 11:
    print("Утро")
elif 12 <= hour <= 17:
    print("День")
elif 18 <= hour <= 21:
    print("Вечер")
elif (22 <= hour <= 23) or (0 <= hour <= 5):
    print("Ночь")
else:
    print("Некорректное время")
####################TASK_3##############################
temp = int(input())
if temp < -10:
    print("Очень холодно")
elif -10 <= temp <= 0:
    print("Холодно")
elif 1 <= temp <= 10:
    print("Прохладно")
elif 11 <= temp <= 25:
    print("Тепло")
else:
    print("Жарко")
####################TASK_4##############################
year = int(input())
if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print("Год високосный")
else:
    print("Год не високосный")
####################TASK_5##############################
a = int(input())
b = int(input())
operation = input()

if operation == '+':
    print(a + b)
elif operation == '-':
    print(a - b)
elif operation == '*':
    print(a * b)
elif operation == '/':
    if b != 0:
        print(a / b)
    else:
        print("Ошибка: деление на ноль!")
else:
    print("Некорректная операция")
print('++++++++++++++++++++++++++++++++++++++++++++++++')
print('Тернарный оператор')
print('++++++++++++++++++++++++++++++++++++++++++++++++')
####################TASK_1##############################
num = int(input())
print("Четное" if num % 2 == 0 else "Нечетное")
####################TASK_2##############################
a = int(input())
b = int(input())
print('число А большое' if a > b else 'число B больше')
####################TASK_3##############################
num = int(input())
print('Число положительное' if num > 0 else 'Число отрицательное' if num < 0 else 'Число равно нулю')
####################TASK_4##############################
age = int(input())
print("Вход разрешен" if age >= 18 else "Вход запрещен")
####################TASK_5##############################
amount = int(input())
final_amount = amount * 0.9 if amount > 5000 else amount
print(final_amount)




































